#Написать программу, которая принимает строку от пользователя и выводит количество символов в этой строке.
print("Количество символов в строке:", len(input("Введите строку:")))

